def caching_fibonacci():
    """
    Функція створює кеш для зберігання результатів обчислень чисел Фібоначчі
    і повертає функцію для обчислення чисел Фібоначчі з кешуванням.
    """
    cache = {}  # Словник для зберігання вже обчислених чисел

    def fibonacci(n):
        """
        Функція обчислює n число Фібоначчі з використанням кешування.

        Параметри:
        n (int): Порядковий номер числа Фібоначчі

        Повертає:
        int: n-е число Фібоначчі
        """
        if n <= 0:
            return 0
        if n == 1:
            return 1
        if n in cache:  # Перевірка, чи значення вже є в кеші
            return cache[n]
        
        # Рекурсивне обчислення числа Фібоначчі
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        return cache[n]

    return fibonacci


# Приклад використання
fib = caching_fibonacci()

# Тестування
print(fib(10))  # Очікувано: 55
print(fib(15))  # Очікувано: 610
print(fib(20))  # Очікувано: 6765

